###  Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/ec2-user/environment/actions-runner/_work/_temp/053fee10-5fae-43a8-9b48-645fb50589d0/terraform-bin show -no-color tf1.plan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.acs730-webserver[0] has changed
  ~ resource "aws_instance" "acs730-webserver" {
        id                                   = "i-067dad9f33cadb278"
      ~ security_groups                      = [
          - "sg-0559587a11c7978a3",
        ]
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Webserver"
            "Owner" = "CAAacs730"
            "Role"  = "WebServerON"
            "env"   = "prod"
        }
        # (31 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

  # aws_instance.acs730-webserver[1] has changed
  ~ resource "aws_instance" "acs730-webserver" {
        id                                   = "i-0435c013a5667f9ea"
      ~ security_groups                      = [
          - "sg-0559587a11c7978a3",
        ]
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Webserver"
            "Owner" = "CAAacs730"
            "Role"  = "WebServerON"
            "env"   = "prod"
        }
        # (31 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

  # aws_instance.acs730-webserver[2] has changed
  ~ resource "aws_instance" "acs730-webserver" {
        id                                   = "i-03daa8715a0f9f150"
      ~ security_groups                      = [
          - "sg-0559587a11c7978a3",
        ]
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Webserver"
            "Owner" = "CAAacs730"
            "Role"  = "WebServerOFF"
            "env"   = "prod"
        }
        # (30 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

  # aws_instance.acs730-webserver[3] has changed
  ~ resource "aws_instance" "acs730-webserver" {
        id                                   = "i-03a46295d1755b12a"
      ~ security_groups                      = [
          - "sg-0559587a11c7978a3",
        ]
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Webserver"
            "Owner" = "CAAacs730"
            "Role"  = "WebServerOFF"
            "env"   = "prod"
        }
        # (30 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

  # aws_instance.acs730gp[0] has changed
  ~ resource "aws_instance" "acs730gp" {
        id                                   = "i-09029d967416e1c65"
      ~ security_groups                      = [
          - "sg-01981ab92fab17118",
        ]
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Private"
            "Owner" = "CAAacs730"
            "env"   = "prod"
        }
        # (29 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

  # aws_instance.acs730gp[1] has changed
  ~ resource "aws_instance" "acs730gp" {
        id                                   = "i-00b193010b33c1bbd"
      ~ security_groups                      = [
          - "sg-01981ab92fab17118",
        ]
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Private"
            "Owner" = "CAAacs730"
            "env"   = "prod"
        }
        # (29 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_instance.acs730-webserver[0] must be replaced
+/- resource "aws_instance" "acs730-webserver" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-067dad9f33cadb278" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-067dad9f33cadb278" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0a7e59cabdec14f68" -> (known after apply)
      ~ private_dns                          = "ip-10-1-1-176.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.1.176" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "3.90.25.172" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0559587a11c7978a3",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Webserver"
            "Owner" = "CAAacs730"
            "Role"  = "WebServerON"
            "env"   = "prod"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "7ae0de85c810d44000acfd1005ef1efe8e16fbbf" -> "274615f8c80a14cd1f28d97ab6e7518cfa904190"
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0559587a11c7978a3",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-025384cf4c6a001a0" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.acs730-webserver[1] must be replaced
+/- resource "aws_instance" "acs730-webserver" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-0435c013a5667f9ea" -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0435c013a5667f9ea" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0592a13c29fda8285" -> (known after apply)
      ~ private_dns                          = "ip-10-1-2-153.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.2.153" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "3.234.250.245" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0559587a11c7978a3",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Webserver"
            "Owner" = "CAAacs730"
            "Role"  = "WebServerON"
            "env"   = "prod"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "7ae0de85c810d44000acfd1005ef1efe8e16fbbf" -> "274615f8c80a14cd1f28d97ab6e7518cfa904190"
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0559587a11c7978a3",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0eda89669e78a873a" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.acs730-webserver[2] must be replaced
+/- resource "aws_instance" "acs730-webserver" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-03daa8715a0f9f150" -> (known after apply)
      ~ availability_zone                    = "us-east-1c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-03daa8715a0f9f150" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-052bddb22c4ef6700" -> (known after apply)
      ~ private_dns                          = "ip-10-1-3-45.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.3.45" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "3.89.8.178" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0559587a11c7978a3",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Webserver"
            "Owner" = "CAAacs730"
            "Role"  = "WebServerOFF"
            "env"   = "prod"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0559587a11c7978a3",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0a640a0ba4db6bb84" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.acs730-webserver[3] must be replaced
+/- resource "aws_instance" "acs730-webserver" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-03a46295d1755b12a" -> (known after apply)
      ~ availability_zone                    = "us-east-1d" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-03a46295d1755b12a" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0f2be8e1e066a43d6" -> (known after apply)
      ~ private_dns                          = "ip-10-1-4-122.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.4.122" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "54.242.252.78" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0559587a11c7978a3",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Webserver"
            "Owner" = "CAAacs730"
            "Role"  = "WebServerOFF"
            "env"   = "prod"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0559587a11c7978a3",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0e9eef7cc3e797e0d" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.acs730gp[0] must be replaced
+/- resource "aws_instance" "acs730gp" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-09029d967416e1c65" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-09029d967416e1c65" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0b8120fde08743378" -> (known after apply)
      ~ private_dns                          = "ip-10-1-5-28.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.5.28" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-01981ab92fab17118",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Private"
            "Owner" = "CAAacs730"
            "env"   = "prod"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-01981ab92fab17118",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0ff066015514bcffa" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.acs730gp[1] must be replaced
+/- resource "aws_instance" "acs730gp" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-00b193010b33c1bbd" -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-00b193010b33c1bbd" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-002cac0d8f3dde34a" -> (known after apply)
      ~ private_dns                          = "ip-10-1-6-74.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.6.74" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-01981ab92fab17118",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Private"
            "Owner" = "CAAacs730"
            "env"   = "prod"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-01981ab92fab17118",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-015aa9cc04f2684ad" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 6 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # aws_instance.acs730-webserver[0] has changed%0A  ~ resource "aws_instance" "acs730-webserver" {%0A        id                                   = "i-067dad9f33cadb278"%0A      ~ security_groups                      = [%0A          - "sg-0559587a11c7978a3",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "prod-Amazon-Linux-Webserver"%0A            "Owner" = "CAAacs730"%0A            "Role"  = "WebServerON"%0A            "env"   = "prod"%0A        }%0A        # (31 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.acs730-webserver[1] has changed%0A  ~ resource "aws_instance" "acs730-webserver" {%0A        id                                   = "i-0435c013a5667f9ea"%0A      ~ security_groups                      = [%0A          - "sg-0559587a11c7978a3",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "prod-Amazon-Linux-Webserver"%0A            "Owner" = "CAAacs730"%0A            "Role"  = "WebServerON"%0A            "env"   = "prod"%0A        }%0A        # (31 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.acs730-webserver[2] has changed%0A  ~ resource "aws_instance" "acs730-webserver" {%0A        id                                   = "i-03daa8715a0f9f150"%0A      ~ security_groups                      = [%0A          - "sg-0559587a11c7978a3",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "prod-Amazon-Linux-Webserver"%0A            "Owner" = "CAAacs730"%0A            "Role"  = "WebServerOFF"%0A            "env"   = "prod"%0A        }%0A        # (30 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.acs730-webserver[3] has changed%0A  ~ resource "aws_instance" "acs730-webserver" {%0A        id                                   = "i-03a46295d1755b12a"%0A      ~ security_groups                      = [%0A          - "sg-0559587a11c7978a3",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "prod-Amazon-Linux-Webserver"%0A            "Owner" = "CAAacs730"%0A            "Role"  = "WebServerOFF"%0A            "env"   = "prod"%0A        }%0A        # (30 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.acs730gp[0] has changed%0A  ~ resource "aws_instance" "acs730gp" {%0A        id                                   = "i-09029d967416e1c65"%0A      ~ security_groups                      = [%0A          - "sg-01981ab92fab17118",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "prod-Amazon-Linux-Private"%0A            "Owner" = "CAAacs730"%0A            "env"   = "prod"%0A        }%0A        # (29 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.acs730gp[1] has changed%0A  ~ resource "aws_instance" "acs730gp" {%0A        id                                   = "i-00b193010b33c1bbd"%0A      ~ security_groups                      = [%0A          - "sg-01981ab92fab17118",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "prod-Amazon-Linux-Private"%0A            "Owner" = "CAAacs730"%0A            "env"   = "prod"%0A        }%0A        # (29 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A+/- create replacement and then destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_instance.acs730-webserver[0] must be replaced%0A+/- resource "aws_instance" "acs730-webserver" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-067dad9f33cadb278" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1a" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      ~ id                                   = "i-067dad9f33cadb278" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      ~ instance_state                       = "running" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      ~ placement_partition_number           = 0 -> (known after apply)%0A      ~ primary_network_interface_id         = "eni-0a7e59cabdec14f68" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-1-176.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.1.1.176" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      ~ public_ip                            = "3.90.25.172" -> (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [ # forces replacement%0A          + "sg-0559587a11c7978a3",%0A        ]%0A      + spot_instance_request_id             = (known after apply)%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "prod-Amazon-Linux-Webserver"%0A            "Owner" = "CAAacs730"%0A            "Role"  = "WebServerON"%0A            "env"   = "prod"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      ~ user_data                            = "7ae0de85c810d44000acfd1005ef1efe8e16fbbf" -> "274615f8c80a14cd1f28d97ab6e7518cfa904190"%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-0559587a11c7978a3",%0A        ] -> (known after apply)%0A        # (9 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification {%0A          ~ capacity_reservation_preference = "open" -> (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      ~ cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          ~ core_count       = 1 -> (known after apply)%0A          ~ threads_per_core = 1 -> (known after apply)%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      ~ enclave_options {%0A          ~ enabled = false -> (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      ~ maintenance_options {%0A          ~ auto_recovery = "default" -> (known after apply)%0A        }%0A%0A      ~ metadata_options {%0A          ~ http_endpoint               = "enabled" -> (known after apply)%0A          ~ http_protocol_ipv6          = "disabled" -> (known after apply)%0A          ~ http_put_response_hop_limit = 1 -> (known after apply)%0A          ~ http_tokens                 = "optional" -> (known after apply)%0A          ~ instance_metadata_tags      = "disabled" -> (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      ~ private_dns_name_options {%0A          ~ enable_resource_name_dns_a_record    = false -> (known after apply)%0A          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)%0A          ~ hostname_type                        = "ip-name" -> (known after apply)%0A        }%0A%0A      ~ root_block_device {%0A          ~ delete_on_termination = true -> (known after apply)%0A          ~ device_name           = "/dev/xvda" -> (known after apply)%0A          ~ encrypted             = false -> (known after apply)%0A          ~ iops                  = 100 -> (known after apply)%0A          + kms_key_id            = (known after apply)%0A          ~ tags                  = {} -> (known after apply)%0A          ~ throughput            = 0 -> (known after apply)%0A          ~ volume_id             = "vol-025384cf4c6a001a0" -> (known after apply)%0A          ~ volume_size           = 8 -> (known after apply)%0A          ~ volume_type           = "gp2" -> (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.acs730-webserver[1] must be replaced%0A+/- resource "aws_instance" "acs730-webserver" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-0435c013a5667f9ea" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1b" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      ~ id                                   = "i-0435c013a5667f9ea" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      ~ instance_state                       = "running" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      ~ placement_partition_number           = 0 -> (known after apply)%0A      ~ primary_network_interface_id         = "eni-0592a13c29fda8285" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-2-153.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.1.2.153" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      ~ public_ip                            = "3.234.250.245" -> (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [ # forces replacement%0A          + "sg-0559587a11c7978a3",%0A        ]%0A      + spot_instance_request_id             = (known after apply)%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "prod-Amazon-Linux-Webserver"%0A            "Owner" = "CAAacs730"%0A            "Role"  = "WebServerON"%0A            "env"   = "prod"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      ~ user_data                            = "7ae0de85c810d44000acfd1005ef1efe8e16fbbf" -> "274615f8c80a14cd1f28d97ab6e7518cfa904190"%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-0559587a11c7978a3",%0A        ] -> (known after apply)%0A        # (9 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification {%0A          ~ capacity_reservation_preference = "open" -> (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      ~ cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          ~ core_count       = 1 -> (known after apply)%0A          ~ threads_per_core = 1 -> (known after apply)%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      ~ enclave_options {%0A          ~ enabled = false -> (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      ~ maintenance_options {%0A          ~ auto_recovery = "default" -> (known after apply)%0A        }%0A%0A      ~ metadata_options {%0A          ~ http_endpoint               = "enabled" -> (known after apply)%0A          ~ http_protocol_ipv6          = "disabled" -> (known after apply)%0A          ~ http_put_response_hop_limit = 1 -> (known after apply)%0A          ~ http_tokens                 = "optional" -> (known after apply)%0A          ~ instance_metadata_tags      = "disabled" -> (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      ~ private_dns_name_options {%0A          ~ enable_resource_name_dns_a_record    = false -> (known after apply)%0A          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)%0A          ~ hostname_type                        = "ip-name" -> (known after apply)%0A        }%0A%0A      ~ root_block_device {%0A          ~ delete_on_termination = true -> (known after apply)%0A          ~ device_name           = "/dev/xvda" -> (known after apply)%0A          ~ encrypted             = false -> (known after apply)%0A          ~ iops                  = 100 -> (known after apply)%0A          + kms_key_id            = (known after apply)%0A          ~ tags                  = {} -> (known after apply)%0A          ~ throughput            = 0 -> (known after apply)%0A          ~ volume_id             = "vol-0eda89669e78a873a" -> (known after apply)%0A          ~ volume_size           = 8 -> (known after apply)%0A          ~ volume_type           = "gp2" -> (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.acs730-webserver[2] must be replaced%0A+/- resource "aws_instance" "acs730-webserver" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-03daa8715a0f9f150" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1c" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      ~ id                                   = "i-03daa8715a0f9f150" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      ~ instance_state                       = "running" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      ~ placement_partition_number           = 0 -> (known after apply)%0A      ~ primary_network_interface_id         = "en
  ```
  </details>
  *Pusher: @Gaurav-17, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - Staging`*